OpenFOAM/myCommentCode/OLAFOAM-master/tutorials/OF16ext/pistonFlumeABS/constant/pistonABSMovementDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pistonMovementDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wavemakerType   Piston;
genAbs          1;
maxStroke       2.;

timeSeries
2( 0. 1000. );

paddlePosition
1( 2( 0. 0.) );

paddleEta
1( 2( 0. 0.) );
